Revit 2024 API
BuiltInFailures.StructuralCustomConnectionFailures Class
 Failures about StructuralConnectionHandler.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class StructuralCustomConnectionFailures
Visual Basic
Public NotInheritable Class StructuralCustomConnectionFailures
Visual C++
public ref class StructuralCustomConnectionFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures
See Also
BuiltInFailures.StructuralCustomConnectionFailures Members
Autodesk.Revit.DB Namespace